app/views/comments/_comment.html.erb

INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["article_id", 2], ["body", "ddd"], ["created_at", "2018-08-16 14:32:24.188309"], ["updated_at", "2018-08-16 14:32:24.188309"]]
---
    <div class="bottom-comment">
      <div class="comment-date"><%=  l comment.created_at , format: :short%></div>