app/views/articles/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 50]]
---
        <div class="col-sm-6 col-md-8">
          <span class="label label-default pull-right"><i class="glyphicon glyphicon-comment"></i><%=article.comments.size %></span>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---

            <i class="glyphicon glyphicon-user"></i> <%=article.user.first_name %>