app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (articles.title ILIKE '%eee%') ORDER BY created_at DESC
SELECT "articles".* FROM "articles" ORDER BY created_at DESC
---
  def index
    @articles = Article.all

    if params[:q].present?
       @articles = @articles.where("articles.title ILIKE :q", q: "%#{params[:q]}%")
    end
    @articles = @articles.order('created_at DESC')

    @list_ip = Article.all.group_by(&:ip)

INSERT INTO "articles" ("user_id", "title", "ip", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["title", "qweqqwqe"], ["ip", "127.0.0.1"], ["text", "qweq"], ["created_at", "2018-08-16 15:05:27.921120"], ["updated_at", "2018-08-16 15:05:27.921120"]]
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    @article.ip = request.remote_ip
    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["title", "xxxxxx111qqqqq"], ["updated_at", "2018-08-20 13:18:54.888124"], ["id", 53]]
---
  def update
    # с помощью Active Record нахожу статью по id, которые беру из параметров
    @article = Article.find(params[:id])
    if @articles.update(page_params)