app/controllers/article_controller.rb

  def create
    @article = Article.create(page_params)
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "test"], ["text", "test"], ["created_at", "2018-08-09 12:27:27.543203"], ["updated_at", "2018-08-09 12:27:27.543203"]]

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" ASC