app/controllers/articles_controller.rb

  def index
    # @articles = Article.all
    @articles = policy_scope(Article)

    if params[:q].present?
       @articles = @articles.where("articles.title ILIKE :q", q: "%#{params[:q]}%")
    end
    @articles = @articles.order('created_at DESC')
    @articles = @articles.page(params[:page])
---
SELECT  "articles".* FROM "articles" WHERE (articles.title ILIKE '%48%') ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"

  def show
    authorize @article
    @article.increment(:view_count, 1)
---
UPDATE "articles" SET "view_count" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["view_count", 1], ["updated_at", "2018-08-21 13:31:03.447741"], ["id", 50]]

  def set_resource
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]