app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.new(comment_params)
    # Получение поользователя из модели devise
    # TODO: отследить глобальные пареметры доступные в контроллерах
    @comment.user = current_user
    @comment.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["article_id", 2], ["body", "qwqwqw"], ["created_at", "2018-08-16 14:14:06.373765"], ["updated_at", "2018-08-16 14:14:06.373765"]]