app/controllers/comments_controller.rb

  def create
    @article = Page.find(params[:id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]