app/controllers/page_controller.rb

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @page = Page.find(params[:id])

INSERT INTO "pages" ("name", "description", "start", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "qq1"], ["description", "fsdfasdfsdafasdfsda"], ["start", 0], ["created_at", "2018-08-07 13:26:07.411397"], ["updated_at", "2018-08-07 13:26:07.411397"]]
---
  def create
    @page = Page.create(page_params)

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def edit
      @page = Page.find(params[:id])

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pages" WHERE "pages"."id" = $1  [["id", 1]]
---
  def destroy
    @page = Page.find(params[:id])
    @page.destroy