app/controllers/ratings_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @article = Article.find(params[:article_id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "ratings" ("ratingable_type", "ratingable_id", "user_id", "mark", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["ratingable_type", "Article"], ["ratingable_id", 1], ["user_id", 1], ["mark", 1], ["created_at", "2018-08-15 15:05:10.953408"], ["updated_at", "2018-08-15 15:05:10.953408"]]
UPDATE "articles" SET "rating" = $1 WHERE "articles"."id" = $2  [["rating", 1], ["id", 1]]
---
  def create
    @article = Article.find(params[:article_id])
    @rating= Rating.new(rating_params)
    @rating.ratingable = @article
    @rating.user = current_user

    if @rating.save
      # TODO: добавить поле рейтинг в модель артикл  посчитать среднее всех оценок по статье и установит
      # установить значение  в поле рейтинг rails average
      #
      avg = @article.ratings.average(:mark).round
      @article.update_column(:rating, avg)