app/controllers/static_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."nickname" = $1 LIMIT $2  [["nickname", "sds"], ["LIMIT", 1]]
---
  def check_nickname
    puts "ssss"
    puts params.inspect
    user =User.find_by(nickname: params['nickname'])